//	Файл: «ХРАНИТЕЛЬ ПАМЯТИ»

//	Если разкомментировать строки с названиями тех датчиков которые не используются в Вашем устройстве, можно освободить некоторое количество памяти.
//	Если разкомментировать строку с названием используемого датчика, компилятор выдаст ошибку.

//	#define	Metro_Disable_KEY		//	Если Вы не используете кнопку.
//	#define	Metro_Disable_RGB		//	Если Вы не используете RGB светодиод.
//	#define	Metro_Disable_RES		//	Если Вы не используете потенциометр.
//	#define	Metro_Disable_BUZ		//	Если Вы не используете звукоизлучатель.
//	#define	Metro_Disable_DHT		//	Если Вы не используете датчик влажности и температуры.
//	#define	Metro_Disable_DSL		//	Если Вы не используете датчик света.
//	#define	Metro_Disable_EXT		//	Если Вы не используете расширитель выводов.
//	#define	Metro_Disable_8X8		//	Если Вы не используете светодиодную матрицу 8х8.
//	#define	Metro_Disable_2RM		//	Если Вы не используете электромеханическое двухканальное реле.

//	Если Вы используете данную библиотеку в различных устройствах, то
//	можно оставить все строки данного файла закомментированными, а
//	в скетчах вставлять разкомментированные строки до подключения файла библиотеки.
